## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_integration.root_integration will be created
  + resource "aws_api_gateway_integration" "root_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "s50ry4jhg5"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:507252742351:function:api/invocations"
    }

  # aws_api_gateway_integration_response.root_integration_response will be created
  + resource "aws_api_gateway_integration_response" "root_integration_response" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "text/html" = ""
        }
      + rest_api_id        = "s50ry4jhg5"
      + status_code        = "200"
    }

  # aws_api_gateway_method.root_method will be created
  + resource "aws_api_gateway_method" "root_method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.proxy" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "s50ry4jhg5"
    }

  # aws_api_gateway_method_response.api_root_response_200 will be created
  + resource "aws_api_gateway_method_response" "api_root_response_200" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "text/html" = "Empty"
        }
      + rest_api_id     = "s50ry4jhg5"
      + status_code     = "200"
    }

  # aws_api_gateway_resource.root will be created
  + resource "aws_api_gateway_resource" "root" {
      + id          = (known after apply)
      + parent_id   = "hm85fkep2e"
      + path        = (known after apply)
      + path_part   = "ANY"
      + rest_api_id = "s50ry4jhg5"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>